class ModelCake {
  final String name;
  final String desc;
  final String longDesc;
  final String image;
  final String image1;
  final String image2;
  final String text1;





  ModelCake(
      {this.name,
        this.desc,
        this.longDesc,
        this.image,
        this.image1,
        this.image2,
        this.text1,
      });
}

List<ModelCake> menu = [
  ModelCake(
    image: 'images/cake0.jpg',
    image1: 'images/c1.jpg',
    image2: 'images/c2.jpg',
    name: "كيك الكاساتا بالفاكه الجافه",
    desc:
    " طريقة جديدة للكيك،كيك بالفواكه المجففةوالكاساتا ",
    text1: '4 بيض + 1/4 ملعقة صغيرة فانليا'
        '\n2/3 كوب زبدة لينة'
        '\n3/4 كوب سكر'
        '\n1/2 1 كوب جبن ريكوتا'
        '\n1/2 كوب سكر بودرة'
        '\n1/4 1 كوب دقيق'
        '\nمُكعبات صغيرة(ملبن) ألوان+مُكعبات فاكهةة+3 ملعقة كبيرة زبيب+ملعقة كبيرة مانجو مُجففة'
        '\nكريمة لباني مخفوقة ومربى الورد للتزيين',

    longDesc: '''– يُسخن الفرن على درجة حرارة 180 مئوية.
– تُخفق الزبدة مع السكر في العجان الكهربائي على سرعة متوسطة باستخدام البدال حتى نحصل على خليط كريمي.
– يُضاف البيض واحدة تلو الاخرى ثم يُضاف الدقيق تدريجياً وتُعجن المكونات حتى تتداخل ونحصل على خليط كيك ناعم.
– يُدهن قالب كيك مستطيل بالقليل من الزبدة ويُرش بالدقيق- مع التخلص من الدقيق الزائد- ثم يُصب خليط الكيك في القالب ويُساوى السطح.
– يُخبز القالب في الفرن لمدة 35 دقيقة أو حتى تمام النضج (يُراعى عدم فتح الفرن أثناء الخبز).
– تُخلط مكونات الحشو( الجبن مع السكر، الملبن، الفاكهة، الزبيب والمانجو) في وعاء مع التقليب، يُترك جانباً.
– يُترك الكيك ليبرد تماماً ثم يُقطع الجزء العلوي منه بطول الكيك ويُوضع جانباً.
– يُفرغ الكيك من المنتصف بحيث نحصل على تجويف للحشو.
– يُملأ التجويف بحشو خليط الجبن ثم يُعاد الجزء العلوي المُقطوع من الكيك ويُغطى به الحشو.
– يُلف كيك الكاساتا بالبلاستيك الشفاف ويُوضع بالفريزر لمدة ساعتين على الأقل.
– يُزين بالكريمة المخفوقة ومربى الورد ثم يُقسم إلى شرائح سميكة ويُقدم على الفور''',
  ),
  ModelCake(
    image: 'images/cake1.jpg',
    image1: 'images/c3.jpg',
    image2: 'images/c4.jpg',
    name: "كيكة البرتقال",
    desc:
    " تعلمي طريقة عمل كيك البرتقال السهل ، لذيذ وطيب ويقدم مع كوب من الشاي ",
    text1: '1و1/2 كوب دقيق+ملعقة صغيره كيك شيف'
        '\nملعقة صغيره حليب بودرة'
        '\nكوب عصير البرتقال+برش برتقالة'
        '\n3 بيض+ملعقة صغيره فانيليا'
        '\nكوب سكر'
        '\n1/2 كوب زبدة سائلة'
        '\n1/2كوب جوز الهند',


    longDesc: '''- نضع الحليب فوق عصير البرتقال ونخلطهم مع الفانيليا والبايكنغ باودر.
- ثم نضع المزيج فوق الدقيق والسكر والبيض وبرش البرتقالة وجوز الهند والزبدة.

- نخلطهم سويا زنسكب الخليط في قالب للفرن ونخبز الكيك على درجة 180 حتى النضج''',
  ),ModelCake(
    image: 'images/cake2.jpg',
    image1: 'images/c5.jpg',
    image2: 'images/c6.jpg',
    name: "كيكة الاناناس المقلوبة",
    desc:
    "كيك الاناناس الهش ، حلى غربي سهل التحضير",
    text1: '150 غم دقيق فاخر+3 ملعقة صغيرة خميرة'
        '\n6 شرائح أناناس طازج دائرية بسمك 1 سم'
        '\nبيضة3'
        '\n غم زبدة'
        '\n150 غم سكر'
        '\n6 حبة كرز معلب أو محلى+7 ملعقة كبيرة عصير أناناس',

    longDesc: '''- نفصل صفار البيض عن البياض ثم نخفق البياض جيداً.
- نخفق الصفار مع 100 غم من السكر ليصبح لونه فاتح ثم نضيف الدقيق و الخميرة بعد تنخيلها.
- نضيف 50 غم من الزبدة المذابة و عصير الأناناس لنحصل على خليط ناعم كالكريمة ثم نضيف بياض البيض المخفوق.
- نحضر الكراميل بما تبقى من السكر و الزبدة في قالب مستطيل لا يلصق بقطر 30x 25 سم.
- ننظف شرائح الأناناس من الجزء الصلب في المنتصف و نوزعها فوق الكراميل.
- نضع حبة كرز في منتصف كل شريحة أناناس ثم نغطي المقادير بالخليط و نسوي السطح.
- نطهو الكعكة في الفرن الساخن عند درجة حرارة 180 مدة 35 إلى 30 دقيقة.
- نقلب الكعكة عندما تبرد في صحن التقديم.''',
  ),ModelCake(
    image: 'images/cake3.jpg',
    image1: 'images/c7.jpg',
    image2: 'images/c8.jpg',
    name: "كب كيك بالاوريو",
    desc:
    "حاجه جديد من الكب كيك سهل وبسيط ",
    text1: '4 بيضات+ذره فانيلا'
        '\n2 كأس دقيق+2 ملعقه صغيره بيكنج بودر'
        '\n1 علبه زبادي'
        '\nثلاثه أرباع كأس زيت'
        '\nكأس ونص سكر مطحون',
    longDesc: '''- اخلطي جميع المقادير الا الدقيق والبيكنج بودر بعض ماتخلطينهم 3 دقايق اضيفي
الدقيق والبكنج ..
-صبي بقوالب الكوب كيك الورق الربع من الخليط ثم حطي حبة اوريو بعدين اضيفي مقدار شوي من الخليط حاولي ماتملينها لانها راح تنتفخ وتطلع من الورق ..
حطيها بالفرن تقريبا ثلث او نص على حسب ..''',

  ),ModelCake(
    image: 'images/cake4.jpg',
    image1: 'images/c9.jpg',
    image2: 'images/c10.jpg',
    name: "كب كبك بالشيكولاته",
    desc:
    "وصفه سهله وسريعه من كب كيك الشيكولاته",
    text1: 'كوب ونص دقيق+ملعقة بيكنج باودر'
        '\n3 بيضات+ملعقة صغيرة فانيليا'
        '\nملعتين كاكاو بودرة'
        '\nكوب سكر'
        '\nكوب حليب سائل'
        '\nنص كوب زبدة',

    longDesc: '''نخفق الزبدة مع السكر

نضيف البيض والفانليا
نضيف الحليب والخفق مستمر
نضيف الدقيق المخلوط بالبيكنغ باودر بالتدريج
نصب الخليط في الاكواب الورقية
ندخله في فرن متوسط الحرارة لمدة 20 دقيقة من الاسفل
نفتح من فوق خمس دقايق او حتى يتحمر
الصوص نحضر دانيت بندق ونضع علية نص كوب كريمة وصوص شيكولاتة
جلاكسى ونقلب جيدا ونضع الصوص على الكب كيك''',


  ),ModelCake(
    image: 'images/cake5.jpg',
    image1: 'images/c11.jpg',
    image2: 'images/c12.jpg',
    name: "كيكه الزبادى المحشيه",
    desc:
    " هل تبحثين عن وصفه كيك مميزه؟ اليكي طريقه عمل كيكه الزبادى ",
    text1: 'كوب وربع دقيق ابيض + م ك باكينج باودر'
        '\n2علبة لبن'
        '\n3 م ك حليب بودره'
        '\nكوب زيت3/4'
        '\n3/4 كوب سكر ابيض ناعم'
        '\n2 بيض + م ص فانيلا بودره',

    longDesc: '''الحشوه :
نص باكت بسكوت شاهي الكبير يكسر خشن + م ص نسكافيه + م ص قرفه مطحونه
ظرف كريم كراميل + نص كوب سكر بني + نص اصبع زبده مذوبه + جوز مكسر
( تخلط وتترك ع جنب )
الطريقه :
نضيف مكونات خليط الكيك مع بعض وتخفق بالمضرب الكهربائي
ادهني الصينيه وغلفيها بالدقيق
الأفضل ماتكثري طبقة الدقيق حتى مايسوى غلاف ع الكيكه ويخرب شكلهآا
بالبدايه ..
نحط طبقة نص خليط الكيك , ثم الحشوه , ثم طبقه الخليط

طبعاً تدخليها فرن حامي ع نار متوسطه من تحت لحد مايبدأ يرتفع الخليط وتحمر الأطراف شوي
بعدهآا تطفي من تحت وتشغلي من فوق لحد ماتستوي وتحمر الطبقه

للتزين :
بالخلاط / نص علبة نستله الكبيره + 4 حبات كيري

وممكن بس نستله ولا هيرشي او توفي الي تحبوه''',
  ),ModelCake(
    image: 'images/cake6.jpg',
    image1: 'images/c13.jpg',
    image2: 'images/c14.jpg',
    name: "كيكة القرفة",
    desc:
    "تعلّمي طريقة عمل كيكة بالقرفة السهلة والسريعة وقدّميها لضيوفك مع القهوة",
    text1: ' 2 ك دقيق+3 م ك بكنج بودر '
        '\nك سكر'
        '\nك حليب'
        '\nم ص قرفة'
        '\n1/3ك زيت'
        '\n2بيض+2 م ص فانيليا'
        '\nم ص ملح'
        '\nمزيج الحشوة:'
        '\n١/٤ كوب سكر'
        '\n١/٢ ١ ملعقة صغيرة قرفة'
        '\n٣ ملاعق طعام زبدة لينة'
        '\nتمزج جيدا وتترك جانبا.',

    longDesc: '''سخنى الفرن على حرارة 180درجة

ادهني قالب الكيكة

اخلطي الدقيق والقرفة والسكر والملح والباكنج بودرفي وعاء واتركيها جانبا .

في وعاء آخر اخلطي البيض مع الحليب والزيت والفانيليا جيدا .

ثم أضيفي له خليط الدقيق واخلطي المقادير جيدا.

صبي نصف المقدار في قالب الكيك.

ثم وزعي نصف مقدار مزيج الحشوة فوقه.

واستخدمي سكين أو شوكة لتوزيع لمزيج توزيع خفيف بواسطة تحريكه.

نصب باقي مقدار الكيك ونغطي الوجه بباقي مزيج الحشوة ورشة أي مكسرات تفضلينها.

ندخلها الفرن ل50 دقيقة تقريبا.

تترك تبرد لعشر دقائق ثم نخرجها من القالب''',
  ),ModelCake(
    image: 'images/cake7.jpg',
    image1: 'images/c15.jpg',
    image2: 'images/c16.jpg',
    name: "كيك السفن آب بالليمون",
    desc:
    "أضيفي طبقاً مميزاً وجديداً من أطباق الحلويات الغربية إلى سفرتك",
    text1: '4 بيض+فانيليا'
        '\n3 كوب دقيق+ملعقة بكينج بودر'
        '\nكوب ونصف سكر'
        '\nكوب زيت'
        '\nكوب سفن اب'
        '\nملعقة صغيرة برش ليمون',

    longDesc: '''نخلط البيض والسكر والفانيلا الى ان يتكاثف الخليط
نضيف الزيت تدريجيا ثم نضيف الطحين والسفن تدريجيا
نضيف برش البرتقال ثم الباكينج باودر
ندهن الصينيه بالزيت ونرشها بالطحين ونحمي الفرن
نضع الخليط بالصينيه ونخبزها على نار متوسطة''',
  ),ModelCake(
    image: 'images/cake8.jpg',
    image1: 'images/c17.jpg',
    image2: 'images/c18.jpg',
    name: "كاساتا فراوله",
    desc:
    "إليكِ طريقة عمل حلى كاسات الفراولة في خطوات سهلة وسريعة من المطبخ الفرنسي",
    text1: 'كيلو فروله فريش'
        '\nربع كيلو كريم شانتيه مخفوق'
        '\nنص كوب كريمه لبانى'
        '\nعمل اسبنج كيك فى صينيه مستطيله',

    longDesc: '''
اسبنج كيك
8 بيض+كوب سكر+كوب ونص دقيق+ربع كوب نشا+نص باكو بكنج بودر+فانليا
البيض مع السكر بالمضرب ثم نقلب النشا مع الدقيق وبعد ارتفاع الخليط نضع الدقيق

المخلوط بالنشا ونقلب بالايدى بهدوء درجة الحراره 160

الكريم

نضرب الكريم شانتيه مع الكريمه اللبانى بمعنى 2 كوب كريم شانتيه بودر+3 كوب ماء مثلج جدا+ ربع كوب سكر
لو الكريمه غير محلاه+ الكريمه اللبانى
ونضربهم بالمضرب جيدا يكون الاسبنج بارد ثم نقسمه ببالسكينه من المنتصف ونضع طبقه عاليه من الكريم
ثم نقوم بوضع الفروله كامله او نقصمها ونغطيها بالكريمه ثم اخر شيء الطبقه التانيه للاسبنج
وتترك فى الفريزر لمدة ساعه ثم نخرجها نقطعا ونزينها

ملحوظه:

الكريمه تكون سميكه وليس سائله
اثناء التقطيع توضع الكينه الاى بنقطع بها فى ماء ساخن جدا ليكون سهل فى التقطيع''',
  ),ModelCake(
    image: 'images/cake9.jpg',
    image1: 'images/c19.jpg',
    image2: 'images/c20.jpg',
    name: "السويسرول بالمربى",
    desc:
    " من اشهى انواع الحلويات الغربية التي تتميز بسهولة تحضيرها وشكلها الجميل",
    text1:'كوب دقيق+1/2ملعقة بكينج بودر1/8 '
        '\n1/2كوب حليب'
        '\n1 ملعقة صغيرة خل'
        '\nبيضه +ملعقة صغيرة فانلية'
        '\n3/4 كوب سكر ناعم'
        '\n1/2 كوب زبدة لينة'
        '\nرشه ملح',
    longDesc: '''نسخن الفرن على درجة حرارة 190
نبطن قالب السويسرول بورق الالومنيوم
ننخل الدقيق والملح فى وعاء الخلط

نخفق الزبدة مع السكر حتى يصبح الخليط كريمى
نضيف بيكربونات الصودا
وكذلك الخل ونقلب نضيف البيضة والفانليا
ونقلب نضيف خليط الدقيق
ونقلب اخيرا نضيف الحليب
الى خليط الكيك
ونقلب

نصب الكيك فى الصنية المخصصه للسويسرول وتكون مستطيله ومنخفصه الحواف
ونساوى سطح الكيك

نخبز الكيك فى الفرن الساخن لمدة 12
دقيقة

تقلب الكيك على ورقة زبدة كبيرة
نبدأ فى لف الكيكه مثل الرول بواسطة ورق الزبدة مع الضغط جيدا
عليها حتى يتكون رول متماسك
نلف الرول جيدا بورق الزبدة

وتترك ساعه ثم يزال ورق الزبده

نضع المربي على
ثلثى الكيك من الداخل مع ملاحظة عدم وصولها الي
الاطراف
نضع المكسرات على المربي
تلف ثانيه جيدا ثم ترش بالسكر البودره''',
  ),ModelCake(
    image: 'images/cake10.jpg',
    image1: 'images/c21.jpg',
    image2: 'images/c22.jpg',
    name: "كيكه النسكافية",
    desc:
    "حاجه كدا لعشاق النسكافيه والقهوة ",
    text1: '4 بيضات+ملعقة فانيلا'
        '\nكاسين طحين+ملعقه صغيره بيكربونات الصوديوم'
        '\nملعقتين طعام بكنج بودر'
        '\n 1/2كاس زيت'
        '\nكاس حليب بودره1/2'
        '\nكاس سكر'
        '\nنصف فنجال ماء',

    longDesc: '''تخلط مقادير الكيك بخفق البيض مع الفانيلا ثم بعدها السكر ثم الحليب مع الاستمرار بالضرب
ثم يضاف الطحين مع البكنج بودر بعدها ندخلها الفرن لين تستوي ولاتفتحين الفرن وتصيرين

بعد ماتستوي الكيكه ونخليها تبرد شوي نسوي الشراب

الشراب :
ربع كاس سكر
ربع كاس ماء
ملعقه صغيره نسكافيه

تغلى المقادير لمدة خمس دقائق
ونشرب الكيك بغمس شوكه صغيره على ارجاء الكيك ومكان الشوكه يسقى

الكريمة :
ظرفين دريم ويب
نص كاس حليب سائل
ملعقة طعام نسكافيه

تخفق المقادير زين ونلبسها الكيكة بعد ما تبرد زين

بعد مالبسناها الكريمه ندخلها الثلاجه ونسوي الزينه اللي فوق

للزينة :
نص كاس سكر
نص كاس لوز مجروش

نذوب السكر على نار هادئة لين يذوب بدون أن يتغيّر لونه يعني لايصير بني محروق ترا بيعطي مراره
بعدها نضيف اللوز للسكر ويقلّب حتى يأخذ لون الكراميل ثم يصب في صينية مدهونة ويترك لين يبرد ثم يكسر قطع صغيره او يفرم مع اضافه ملعقتين سكر بودره بعد فرم اللوز وتزين بها الكيك''',
  ),

];


List<ModelCake> menu1 = [
  ModelCake(
    image: 'images/cake11.jpg',
    image1: 'images/b1.jpg',
    image2: 'images/b2.jpg',
    name: "السينابون",
    desc:
    "عشاق السينابون أو لفائف القرفة كثيرون ولكن من يعلم طريقة تحضيره فى المنزل هم أقلية",
    text1: '4 كوب دقيق+رشة بيكنج بود'
        '\nبيضتين+رشة فانيليا'
        '\nكوب حليب دافي'
        '\nنصف كوب سكر'
        '\nنصف كوب زبده بدرجة حراره الغرفه'
        '\n2 معلقه صغيره خميره فوريه'
        '\nرشة ملح',
    longDesc: '''- في طبق كبير هنضيف كل المقادير مع بعض ماعدا الدقيق ونخلطهم كويس وبعدين نضيف الدقيق بالتدريج ونعجنهم كويس لحد ما العجينه تلم وماتلزقش في الايد نغطيها ونسيبها تخمر في مكان دافي لمدة ساعه ونصف أو ساعتين.
- نفرد العجينه بالنشابه على رخامه مرشوشه دقيق على شكل مستطيل سُمكه 1 سم تقريباً.
- ندهنها زبده ونبدأ نحشيها والحشو عباره عن كوب سكر بني عليه 4 او 5 معالق كبيره قرفه وممكن تضيفوا نصف معلقة كاكاو او نسكويك.
- نبدأ نلف العجينه بإنتظام وبراحه خالص على شكل رول ونقطعها قطع متساويه بإستخدام خيط تقيل أو سكينه حاميه.
- نبدأ نرص القطع بالطول في صينيه فيها ورق زبده أو مدهونه زبده ولازم نسيب مسافه 2 سم بين كل قطعه والتانيه عشان مايلزقوش في بعض.
- نسيبها تخمر ساعه وندخلها فرن مسخن مسبقاً على درجة حراره 200 لمدة ربع ساعه هنلاحظ ان اللون بقى ذهبي فاتح نطلعها ونسيبها 5 دقايق وبعدين نحط عليها الصوص.

طريقة الصوص :
- ربع كوب جبنه كريمي
- معلقه كبيره زبده بدرجة حرارة الغرفه
- كوب وربع سكر بودره
- 4 معالق كبيره حليب
- نصف معلقه صغيره فانيليا

- في بوله كبيره نحط المكونات كلها ونخفقها بإستخدام المضرب الكهربائي لحد ما القوام يبقا تقيل ومتماسك ولو عايزين الصوص خفيف زودوا حليب كل ما كان الحليب اكتر كل ما كان الصوص اخف.
- نحط الصوص على السينابون بعد 5 دقايق من خروجها من الفرن.
''',
  ),
  ModelCake(
    image: 'images/cake12.jpg',
    image1: 'images/b3.jpg',
    image2: 'images/b4.jpg',
    name: "كرواسون",
    desc: " من اشهر الوصفات الفرنسية للفطور. اكتشفوا طريقة عمل منزلية بسيطة",
    text1: '\n5 كوبايات دقيق'
        '\nمعلقه صغيره خميره'
        '\n كوباية مياه دافيه2'
        '\nنص كوباية زيت'
        '\nربع كوباية حليب بودره'
        '\n معلقه كبيره سكر'
        '\nزبده للفرد+اي نوع حشو تحبوه'
        '\nبيضه مع رشة فانيليا للتلميع'
        '\nرشة ملح',
    longDesc: '''- في طبق غويط هنحط كوبايتين دقيق ونضيف الخميره والسكر ورشة الملح والحليب البودره ونخلطهم كويس مع بعض.
- نضيف المياه بالتدريج ونخلطهم تاني لحد ماتتجانس المكونات مع بعضها.
- نغطي العجينه ونسيبها 10 دقايق عشان تخمر.
- بعد ال 10 دقايق نحط الزيت وباقي كمية الدقيق ونعجن العجينه مره كمان لحد ما تبقا طريه و متماسكه.
- نقسم عجينة لكور متوسطة الحجم ونسيبها ترتاح شويه حوالي ٥ دقايق.
- على سطح مرشوش عليه شوية دقيق نفرد كل كوره من العجينه بالنشابه لحد ماتبقا رقيقه وندهنها بالزبده.
- نحط كور العجين فوق بعضها، ولازم ندهن زبده بين كل طبقة والتانيه.
- نفرد كل الطبقات مره كمان بالنشابه لحد ما الطبقه تبقا رقيقه وبعدين نقطعها مثلثات متساوية الحجم.
- نضيف الحشو حسب الرغبه ونلف براحه من رأس المثلث فوق لحد تحت.
- نجيب صينيه ونرص فيها الكرواسون.
- نخفق البيضه مع رشة الفانيليا وندهن بيها الكرواسون ونسيبه نص ساعه يخمر.
- نسخن الفرن على درجة حراره 180.
- ندخل الصينيه الفرن لمدة 20- 25 دقيقه، لحد ما يستوي الكرواسون ويحمر وياخد اللون الدهبي.
''',
  ),ModelCake(
    image: 'images/cake13.jpg',
    image1: 'images/b5.jpg',
    image2: 'images/b6.jpg',
    name: "الإكلير",
    desc:
    "طريقة عمل الإكلير فى المنزل أحلى من الحلوانى",
    text1: 'مقادير العجينه:\n'
        '\n كوباية دقيق'
        '\nكوباية مياه'
        '\nربع كوباية زبده'
        '\nمعلقه صغيره فانيليا سايله+3 بيضات'
        '\nرشه ملح'
        '\n‏‎مقادير الحشوة:'
        '\nكوباية حليب'
        '\nصفار 3 بيضات+نص معلقه صغيره فانيليا سايله'
        '\nربع كوباية سكر+2 معلقه كبيره نشا+رشة ملح'
        '\n‏‎مقادير صوص الشوكولاته:'
        '\nربع كوباية كريمة خفق'
        '\n نص كوباية شوكليت شيبس او شوكولاته خام'
        '\n معلقه صغيره عسل'
        '\nمعلقه صغيره فانيليا سايله',

    longDesc: '''‏‎- اول حاجه نجهز الحشوه، نسخن كوب اللبن على النار لحد ما يسخن شويه بس مش هنخليه يغلي.
‏‎- في طبق غويط نخفق صفار البيض مع السكر والنشا والفانيليا ونركنه على جنب.
‏‎- نحط الحليب على الصفار مع التحريك السريع بالمضرب السلك.
‏‎- نحط الخليط على النار ونقلب بس لحد ما الكتل تختفي ويتقل.
‏‎- نرفعه من على النار ونسيبه لحد ما يبرد ولازم نغطيه بنايلون ستريتش او كيس بلاستيك عشان مايعملش قشره ويفضل كريمي.
‏‎- في حله على النار نحط المياه مع الزبده لحد ما تغلي.
‏‎- ننخل الدقيق ونضيفله الملح وننزل بيه على المياه والزبده مره واحده ونقلب بسرعه بمعلقه خشب لحد ما الدقيق يختفي خالص والعجينه تبقا متماسكه.
‏‎- نرفعها من على النار ونسيبها تبرد حوالي 5 دقايق.
‏‎- نحط بيضه واحده مع معلقة الفانيليا ونخلطهم كويس لحد ما البيضه تختفي.
‏‎- نحط البيضه التانيه ونقلب لحد تختفي والبيضه التالته بنفس الطريقه.
‏‎- نسخن الفرن على 200 درجه.
‏‎- نجهز صينيه كبيره ونفرد فيها ورق زبده
‏‎- نشكل العجينه بايدينا بالطول زي العيش الفينو او نحط العجينه في القمع ونشكلها صوابع طويله ونرصها في الصينيه.
‏‎- ندخل الصينيه الفرن على درجة حراره 200 لمدة 25 : 30 دقيقه وبعد مايستوي ولونه يبقا دهبي نطفي الفرن ونسيبه 5 دقايق والفرن مطفي ومقفول وبعدين نخرجه من الفرن ونسيبه يهدا خالص.
‏‎- نفتح صوابع الإكلير بسكينه مشرشره من الجنب زي السندويتش ونحشيها بالكاستر باستخدام القمع.
‏‎- تجهيز صوص الشوكولاته للتزيين: نخلط الكريمه مع العسل والفانيليا ونحطها على النار لحد ما تسخن، نرفعها من على النار وننزل عليها بالشوكليت شيبس او اي نوع شوكولاته تحبوه ونقلب بسرعه لحد ماتدوب خالص.
‏‎- نغطي صوابع الإكلير من فوق بصوص الشوكولاته ولما الصوص ينشف على الاكلير ممكن تسيحوا شوكولاته بيضا على حمام مائي وتعملوا بيها خطوط وبالهنا والشفا.''',
  ),ModelCake(
    image: 'images/cake14.jpg',
    image1: 'images/b7.jpg',
    image2: 'images/b8.jpg',
    name: "دوناتس",
    desc:
    "مين عايز دوناتس هشة ورائعة و بطريقه سهله و سريعه",
    text1: '\n5 كوب دقيق+ معلقة صغيرة بيكنج بودر+رشة ملح'
        '\nبيضتين بدرجة حرارة الغرفه +معلقة صغيرة فانيليا'
        '\nنصف كوب زبدة بدرجة حرارة الغرفه'
        '\nكوب وربع حليب دافي'
        '\n معلقة كبيرة سكر'
        '\nمعلقه كبيرة خميرة',

    longDesc: '''- في طبق كبير هنحط كل المكونات ونعجنهم كويس لمدة 10-15 دقيقة لحد ماالعجينة تبقى طرية ومش بتلزق في الايد.
- نغطي العجينه بكيس نايلون ونسيبيها تخمر لمدة ساعة بالظبط لا اكتر ولا اقل.
- نفرد العجينه بالنشابه على رخامه مرشوشة بشوية دقيق بسيط ونبدأ نقطعها بقطاعة الدوناتس ونسيبها ترتاح لمدة نصف ساعة.
- نقليها في زيت سخن بس مش اوي لحد ما لونها يصفر، كل وش بياخد اقل من دقيقه وممكن نرصها فى صينيه مدهونه بشوية زيت وندخلها الفرن على درجة حرارة متوسطه مع تقليبها لحد ما لونها يبقى ذهبي.
- نصفيها من الزيت على مناديل مطبخ ورقيه ونسيبها تبرد ونزينها بالسكر البودره او الايسينج أو الشوكولاته المذابه وبالهنا والشفا.''',


  ),ModelCake(
    image: 'images/cake15.jpg',
    image1: 'images/b9.jpg',
    image2: 'images/b10.jpg',
    name: "البان كيك",
    desc:
    "يعد البان كيك واحدًا من أسهل الأكلات السريعة التى يمكن تحضيرها كوجبة إفطار",
    text1:'\nكوب ونصف دقيق+2 معلقه صغيره بيكينج بودر'
        '\n2 معلقه صغيره سكر'
        '\n(معلقه صغيره بيكينج صودا (كربوباتو'
        '\nبيضتين كبار+معلقه صغيره فانيليا'
        '\nكوب حليب دافي'
        '\nربع كوب زبده مذابه'
        '\nربع معلقه صغيره ملح',

    longDesc: '''- في طبق كبير هننخل الدقيق مع البيكينج بودر والبيكنج صودا والسكر والملح والفانيليا.
- نضرب البيض لحد ما ينفش وبعدين نضيف الحليب والزبده المذابه ونخفقهم كويس وبعدين نضيف خليط الدقيق ونخفقهم تاني لحد ما العجينه تبقى متماسكه ومش سايله اوي.
- نسخن طاسه تيفال على نار متوسطه وندهنها بنقطتين زيت او زبده وناخد شويه من العجينه بمغرفه صغيره وننزل بيها في نص الطاسه.
- نوطي النار خالص واول ما اللون يبقى دهبي نقلبه على الوش التاني لحد ما يحمر.
- ملحوظه: لازم نمسح الطاسه بفوطه نضيفه وندهنها بنقطتين زيت او زبده بين كل واحده والتانيه.
- بعد ما نخلص الكميه كلها ممكن نقدمه مع النوتيلا او العسل والفواكه.''',
  ),ModelCake(
    image: 'images/cake16.jpg',
    image1: 'images/b11.jpg',
    image2: 'images/b12.jpg',
    name: "السكونز الانجليزي",
    desc:
    " وصفة سكونز مثالية فهي لذيذة بالإضافة إلى كونها سهلة وسريعة التحضير",
    text1: '\n 2 و 2/3 كوب دقيق '
        '\n3 معالق صغيرة بيكنج بودر'
        '\n1/2 كوب سكر بني فاتح'
        '\nمعلقة صغيرة قرفة مطحونة'
        '\n114 جرام زبدة غير مملحة، باردة جدا ومقطعة قطع صغيرة'
        '\nمعلقة صغيرة فانيليا+بيضة كبيرة'
        '\n3/4 كوب كريمة خفق ثقيلة'
        '\nشوكليت شيبس حسب الرغبة'
        '\nكوب جوز مفروم'
        '\nلغسول البيض:'
        '\nبيضة كبيرة مخفوقة'
        '\nمعلقة صغيرة حليب أو ماء'
        '\n2 معلقة كبيرة سكر بودرة للرش',

    longDesc: '''نسخن الفرن على 200 درجة.
نحط ورقة زبدة على صينية خبز كبيرة. ونسيبها على جنب.
في طبق كبير نمزج الدقيق والملح والبيكنج بودر والسكر البني والقرفة ونخلط كويس لحد ما المكونات تتجانس.
نقطع الزبدة مكعبات صغيرة ونحطها في الخليط (باستخدام أصابعك أو شوكتين أو قطاعة عجين)
في طبق نخفق البيض والقشدة والفانيليا مع بعض. نضيف المزيج السائل لخليط الدقيق.
نضيف رقائق الشوكولاتة والجوز. ونستخدم شوكة لتقليب كل المكونات مع بعضها.
فرغي العجين السايب على رخامة نظيفة ومرشوشة بالقليل من الدقيق. اعجني العجينة وبعدين شكلها على شكل قرص.
اقطع القرص إلى 8 قطع زي اللي في الصورة وانقليهم براحة على ورقة الزبدة مع فصلهم بمقدار 5 سم.
ادهني كل قطعة بقليل من خليط البيض.
تخبز لمدة 18 - 20 دقيقة، أو لحد ما لونها يبقى ذهبي فاتح.
خلي السكونز يبرد لمدة 10 دقائق على صينية الخبز ورشيه بسكر بودرة قبل التقديم.''',

  ),ModelCake(
    image: 'images/cake17.jpg',
    image1: 'images/b13.jpg',
    image2: 'images/b14.jpg',
    name: "الماكرون",
    desc:
    "يعتبر حلى الماكرون من الحلويات الفرنسية ، وهو عبارةٌ عن حلوى خفيفة تقدّم إلى جانب فنجان من القهوة",
    text1: '\n100 جرام لوز مقشر، ومطحون'
        '\n1/2  كوب سكر بودر'
        '\n2 بياض البيض'
        '\nرشة ملح'
        '\nمعلقتين سكر عادى'
        '\nنقطين من ألوان الطعام',

    longDesc: '''- نقوم بطحن اللوز جيداً حتى يصبح فى قوام الدقيق.
- نضع على اللوز السكر العادى ونقلبه جيداً حتى يصبح كله مزيج واحد.
-  نضع بياض البيض فى إناء آخر مع رشة الملح ونقوم بخفقه حتى يصبح مثل الكريمة. 
-  نضيف السكر البودرة إلى الكريمة الناتجة عن بياض البيض ونستمر فى التقليب السريع دون توقف.
- نقوم بإضافة لون الطعام المفضل، نحن قومنا بإضافة لون أحمر حتى يصبح الماركون لونه زهرى.
-  نحضر دقيق اللوز ونقوم بإضافته إلى كريمة البيض والسكر البودرة، ونقلب جيداً مع مراعاة أن يتمزج كل المزيج سوياً، ولابد أن نقلب من أسفل إلى أعلى أو العكس. 
-  نحضر الصينية المخصصة للماكرون ونضع فيها ورق زبدة، ولكن لابد أن يتم تحديد مكان الماكرون بقلم حتى نضع كمية متساوية، وبعد النضج يخرج فى حلقات متساوية.
- لابد أن نراعى أن نضع العجين أصغر من الدائرة المحدد لأن عجين الماكرون يكبر بالحرارة عندما يدخل الفرن.
-  نقوم بإدخال الصينية إلى الفرن على درجة حرارة 150، ولكن يجب أن يكون الفرن مشتعل من قبلها بفترة حتى يكون ساخن ويترك لمدة 12 دقيقة مع مراقبته من حين لآخر.
- عند خروج الماكرون من الفرن نتركه ليبرد ولا نتسرع فى إخراجه من الصينية حتى لا يتكسر.
- نحضر الكريم شانتيه، والباقى من كريمة بياض البيض والسكر البودرة ونضع عليهما ½ملعقة فانيليا، ومعلقة زبدة ونكمل الخفق جيداً حتى يصبح مزيج واحد ثم ندخلها إلى الفريزر لمدة ساعة على الأقل.
 – نقوم بوضع الكريم شانتيه بين قطعتين من الماكرون، مع مراعاة عدم وضع كريمة كثيرة حتى لا تخرج من الجانبين.
 – نضع الماكرون المحشو بالكريمة فى الثلاجة لمدة ساعة على الأقل قبل تقديمه.
''',

  ),ModelCake(
    image: 'images/cake18.jpg',
    image1: 'images/b15.jpg',
    image2: 'images/b16.jpg',
    name: "الشوروز",
    desc:
    "أصابع الشورو حلى من المطبخ الاسباني سهل وسريع التحضير ومكوناته بسيطة",
    text1: '\nلتحضير العجينة:'
        '\n3 كأس دقيق'
        '\n3 كأس ماء'
        '\nبيضة+معلقة صغيرة فانيليا'
        '\n 3 معالق كبار زبدة'
        '\nرشة ملح'
        '\nلتحضير صوص الشوكولاتة:'
        '\nمعلقتين كبار كاكاو'
        '\nمعلقة كبيرة حليب بودرة'
        '\nنصف معلقة صغيرة فانيليا'
        '\nنصف كأس ماء'
        '\nللتزيين:'
        '\nقرفة مطحونة+سكر ناعم',
    longDesc: '''- في حلة عميقة على النار نضع الماء مع رشة الملح والفانيليا والزبدة لحد ما الماء يغلي والزبدة تدوب وتمتزج المكونات مع بعضها.
- نبعد الحلة عن النار ونضيف الدقيق دفعة واحدة ونقلبه مع المكونات لحد ما نحصل على عجينة قوامها طري.
- بعد ما تبرد العجينة نضيف البيضة وندعكها مع العجينة كويس.
- نضع القليل من العجينة في القمع المخصص للشورو ونشكل أصابع متساوية منها.
- نقلي الأصابع في زيت غزير بعد تحميته قليلا.
- نخلط الكاكاو والفانيليا والحليب والماء ونحركهم كويس ليصبح صوص الشوكولاتة جاهز.
- نزين اصابع الشورو بالسكر والقرفة حسب الذوق وبجانبها صوص الشوكولاتة لتكون جاهزة للتقديم.''',

  ),ModelCake(
    image: 'images/cake19.jpg',
    image1: 'images/b17.jpg',
    image2: 'images/b18.jpg',
    name: "الوافل",
    desc:
    "نقدم لك أشهر الحلويات الغربية، وصفة الوافل السريع والسه،",
    text1: '\nكوب دقيق+معلقة صغيرة بيكنج بودر'
        '\nكوب الا ربع حليب'
        '\nنصف كوب سكر'
        '\nبيضة+معلقة صغيرة فانيليا'
        '\nربع كوب زبدة'
        '\nرشة ملح',
    longDesc: '''- في طبق كبير ننخل الدقيق ونضيف عليه السكر والفانيليا والملح والبيكنج بودر ونخلطهم كويس.
- نخفق البيض ونضيف الحليب والزبدة لحد يمتزجوا مع بعض.
- نضيف خليط السكر والدقيق والملح والفانيليا والبيكنج بودر الى البيض والحليب والزبدة ونستمر بالخفق لحد ما تتشكل عجينة سائلة.
- نضع العجينة في الثلاجة لمدة 3 ساعات
- ندهن قالب الوافل بقليل من الزيت ونستنى لحد ما درجة حرارته تبقى مناسبة.
- نصب خليط الوافل في القالب بواسطة مغرفة ونملى ثلثين القالب تقريبا.
- نستنى كام ثانية ونقفل غطاء القالب ونستنى عدة دقائق حسب الجهاز لحد ما الوافل يكتسب اللون الذهبي
– خرجي الوافل من القالب وزينيه بالكريمة المخفوقة او صوص الشوكولاتة او قطع الفواكه وقدميه.
ملحوظة:
يمكن عمل الوافلز بالشوكولاتة: يضاف 3 معالق كبار كاكاو مع قليل من الحليب وتقلب مع الخليط السابق.''',

  ),ModelCake(
    image: 'images/cake20.jpg',
    image1: 'images/b19.jpg',
    image2: 'images/b20.jpg',
    name: "الباستا فلوره",
    desc:
    "من الحلويات الخفيفة وسهلة التحضير، وظهرت لأول مرة في الأرجنتين",
    text1: '\nكبايتين دقيق+معلقه ونص صغيره بيكينج بودر'
        '\nكباية سكر بودره'
        '\nكبايه الا ربع زبده'
        '\n معلقه صغيره فانيليا+3 بيضات'
        '\nرشة ملح'
        '\nمعلقه صغيره لبن رايب او زبادي'
        '\n مربى توت او اي طعم مربى تحبوه ',
    longDesc: '''- ننخل الدقيق كويس ونخلطه مع البيكنج بودر والملح
- نضرب السكر مع الزبده بالمضرب الكهربائي أو المضرب السلك وبعدين نضيف لهم البيض والفانليا واللبن الرايب او الزبادي ونستمر في الخفق
- نضيف خليط الدقيق ونعجن بايدنا لحد مانخلط المكونات كويس مع بعضها والعجينه تبقى لينه ومتلزقش فى ايدينا.
- نحط العجينه في كيس بلاستيك ونسيبها ترتاح شويه في التلاجه حوالى نص ساعه.
- نطلع العجينه من التلاجه ونفردها براحه على رخامه مرشوشه بشوية دقيق.
- نفرد 3 أرباع مقدار العجينه في صينيه او قالب مدهون بالزبده ونمد العجينه في الصينيه كويس ونشيل من الزيادات اللي في جوانب الصينيه.
- نقسم كمية العجينه اللي باقيه لكور صغيره ونشكلها لشرايط طويله ونسيبها على جنب.
- نخرم العجينه بالشوكه ونغطيها بورقه زبده. - ندخل الصينيه فرن حرارته متوسطه ونسيبها ١٠ دقايق لحد ما لون جوانب العجينه يتغير. - نخرج الصينيه من الفرن ونشيل ورقة الزبده ونفردها بمربى التوت او اي نوع تحبوه ونزينها بشرايط العجينه بالطول والعرض.
- ندخل الصينيه الفرن مره كمان ونسيبها عشر دقائق لحد ما وش الشرايط يحمر وبالهنا والشفا.''',
  ),ModelCake(
    image: 'images/cake21.jpg',
    image1: 'images/b21.jpg',
    image2: 'images/b22.jpg',
    name: "كريب النوتيلا",
    desc:
    "من أشهر حشوات الكريب هي حشوة شوكولاتة النوتيلا، تعلمي طريقه تحضيره الان",
    text1: '\n2 بيضة'
        '\nكوب حليب'
        '\nنصف كوب ماء'
        '\n6 معالق كبيرة زبدة سايحة'
        '\nبياض بيضة'
        '\nذرة ملح'
        '\nنصف كوب نوتيلا'
        '\nكوب دقيق',
    longDesc: '''- في طبق متوسط الحجم، اخلطي البيض والحليب والماء والملح كويس ثم اضيفي الدقيق وقلبي المزيج كويس لحد ما يبقا متجانس.
- ضيفي الزبدة السايحة على العجين السابق مع التقليب المستمر لحد ما يمتزج الخليط كويس.
- على درجة حرارة متوسطة، حطي قليل من العجين بما يعادل ثلث كوب في الطاسة التيفال، وراعي إنك تفردي العجين فيها بحيث تكون متساوية. ممكن تفردي العجين عن طريق معلقة أو أداة الفرد المخصصة لعمل الكريب.
- استني دقيقتين واقلبي الكريب على الوش التاني لمدة دقيقة او لحد ما يحمر لونه.
- حطي الكريب على طبق مسطح، وضيفي عليه النوتيلا بالكمية اللي تحبيها.
-دلوقتي تقدري تقدمي الكريب بالنوتيلا بالطريقة اللي تحبيها سواء كان ملفوف حول نفسه أو بواسطة طيه مرتين أو أربعة ليعطي الشكل المثلث. - ممكن كمان تضيفي سكر بودرة أو كريم شانتيه او ايسكريم للتزيين.''',
  ),

];

List<ModelCake> menu2 = [
  ModelCake(
    image: 'images/drink0.jpg',
    image1: 'images/d1.jpg',
    image2: 'images/d2.jpg',
    name: 'ميلك شيك الاوريو',
    desc: 'ميلك شيك أوريو من الوصفات العالميّة الشعبيّة واللذيدة،',
    text1: '\n 8حبات بسكوت اوريو'
        '\n2 كوب حليب بارد'
        '\nربع كوب'
        '\nنصف كوب سكر'
        '\nكوب ونصف ايس كريم فانيليا'
        '\nمكعبات ثلج مجروش',
    longDesc: '''. فتتي بسكويت الأوريو إلى قطع صغيرة باليد.
. اخفقي الكريمة في وعاء الخلاط الكهربائي حتى تحصلي على مزيج كثيف، أدخليها إلى الثلاجة حتى تجمد.
. ضعي الآيس كريم والحليب في وعاء الخلاط الكهربائي ثم اخلطي المكونات حتى تتجانس.
. أضيفي بسكويت الأوريو، ثم أعيدي خلط المكونات لتحصلي على ميلك شيك متجانس.
. وزعي الميلك شيك في أكواب ثم زيني الوجه بالكريمة المخفوقة قبل التقديم.''',
  ),
  ModelCake(
    image: 'images/drink1.jpg',
    image1: 'images/d3.jpg',
    image2: 'images/d4.jpg',
    name: 'ميلك شيك النسكافيه والفانيليا',
    desc: 'إليك طريقة سهلة وسريعة لتحضير ميلك شيك النسكافيه بالفانيليا؛ لتواجهي حرارة الطقس خلال فصل الصيف.',
    text1: '\nمعلقة صغيرة نسكافيه'
        '\nكوب لبن بارد'
        '\nأيس كريم فانيليا',
    longDesc: '''ذوبي النسكافيه في اللبن البارد واخلطيهما مع الأيس كريم جيدًا، ثم ضعيها في كوب التقديم وزينيها بقطع الشيكولاته أو الكريم شانتيه.''',
  ),

  ModelCake(
    image: 'images/drink2.jpg',
    image1: 'images/d5.jpg',
    image2: 'images/d6.jpg',
    name: 'سموثي الليمون والنعناع',
    desc: 'عصير الخضار أو سموثي الليمون و النعناع ، له طعم لذيذ و سريع التحضير  ',
    text1: '\n3 أكواب مكعبات الثلج'
        '\n1 ثمرة تفاح '
        '\n1/2 كوب من العنب الأخضر'
        '\n1 قشر ليمون'
        '\n1/2 كوب زبادي'
        '\n1/2 كوب عصير جريب فروت غير محلي'
        '\n7 أوراق نعناع طازج'
        '\n2 ملاعق كبيرة من العسل'
        '\n1 معلقة كبيرة سكر'
        '\nوراق نعناع للتزيين',
    longDesc: '''ضفي مكعبات  الثلج إلي وعاء الخلاط و قطعي التفاح إلي أجزاء و إضافته إلي وعاء الخلاط .
    بعد ذلك ، ضفي العنب و  قشر الليمون و عصير الليمون إلي الخلاط  و الزبادي و عصير الجريب فروت  و العسل و السكر  و النعناع ، بعدها قومي بتشغيل الخلاط .
و إيقاف تشغيله بمجرد أن يصبح الخليط سموثي .
أصبح جاهز لصبه بداخل  أكواب التقديم و التزيين بأوراق النعناع .
يمكنك الأن تقديمه علي الفور .''',
  ),

  ModelCake(
    image: 'images/drink3.jpg',
    image1: 'images/d7.jpg',
    image2: 'images/d8.jpg',
    name: 'سموثي البلوبيري ',
    desc: 'إستمتعى أنتى و أولادك وعائلتك بسموثى البلوبيرى المجمد الرائع والمميز',
    text1: '\n 1 كوب حليب قليل الدسم'
        '\n1/2 كوب بلوبيري مجمد'
        '\n2 ملعقة كبيرة زبادي '
        '\n1 ملعقة كبيرة عسل نحل'
        '\n1 ملعقة كبيرة جنين القمح',
    longDesc: '''توضع المكونات معاً في خلاط كهربائي .
وتصب في كوب وتقدم.
يقدم مع الكيك أو المافن بالبلوبيرى اللذيذ ''',
  ),

  ModelCake(
    image: 'images/drink4.jpg',
    image1: 'images/d9.jpg',
    image2: 'images/d10.jpg',
    name: 'سموثي جرين مكس',
    desc: ' هو خليط من الخضره و الفواكه بطريقه حلوه و صحيه',
    text1: '\n1و1/2 كوب سبانخ'
        '\n عصير ليمونه'
        '\n1/4 كوب بقدونس'
        '\nنص خياره'
        '\nموزه'
        '\nكوب ماء بارد'
        '\nمعلقه عسل'
        '\nمكعب ثلج 2 ',
    longDesc: '''نقوم بتقطيع المكونات ونضعها ف الخلاط و من ثم يقدم''',
  ),

  ModelCake(
    image: 'images/drink5.jpg',
    image1: 'images/d11.jpg',
    image2: 'images/d12.jpg',
    name: 'كافيه لاتيه مثلج',
    desc: 'كافيه لاتيه لذيذ سواء كان ساخناً أم بارداً وهو شهي للغاية وخاصة عند مشاركته مع الأصدقاء',
    text1: '\n1 كأس من الحليب البارد'
        '\n1/4 كأس من قطع الثلج'
        '\n1 ملعقة صغيرة من بودرة النسكافيه'
        '\n1 ملعقة صغيرة من السكر الأبيض أو أكثر حسب الذوق'
        '\nفنجان ماء ساخن دون الغليان',
    longDesc: '''نخلط في وعاء كلاً من الماء الساخن والنسكافيه والسكر ونخفق لدقيقتين حتى تمتزج جيداً ويصبح المزيج سميكاً وفيه رغوة ونضعه جانباً حتى يبرد قليلاً .
نضع مكعبات الثلج في كأس ونسكب فوقه الحليب البارد ثم نسكب مزيج النسكافيه والسكر ونحرك قليلاً وبذلك يكون لاتيه البارد جاهزاً للتقديم .''',
  ),

  ModelCake(
    image: 'images/drink6.jpg',
    image1: 'images/d13.jpg',
    image2: 'images/d14.jpg',
    name: 'اسبريسو',
    desc: 'تتمتع قهوة الاسبريسو بشعبية واسعة بين محبي القهوة وذوّاقيها',
    text1: '\nكوب وربع ماء مُثلّج'
        '\nربع كوب من البنّ المطحون',
    longDesc: '''حرّك قهوة البُنّ المطحون في الماء المُثلّج وقلّبه جيّداً حتّى تختفي كتل البن. اترك المزيج لتعتدل درَجه حرَارَته من 5 الى 6 ساعات. ضعه على النّارَ واتركه حتّى ما قبل الغليان، وقدّمه في فنجان صغير.''',
  ),

  ModelCake(
    image: 'images/drink7.jpg',
    image1: 'images/d15.jpg',
    image2: 'images/d16.jpg',
    name: 'موكا بارد',
    desc: 'مشروب موكا بارد الذي نشربه في المحلات يمكن تحضيره لضيوفك وعائلتك في البيت',
    text1: '\nكأس قطع ثلج صغيرة'
        '\nملعققتين من طعام سكر أبيض'
        '\nملعقة طعام كاكاو'
        '\nملعقتين صغيرة ونصف من نسكافيه'
        '\nكأس من الحليب'
        '\nشوكولاته سائلة للتزين',
    longDesc: '''بداية نحضر الخلاط الكهربائي ثم نجهز المكونات أي كأس الحليب والسكر والكاكاو والنسكافيه ويجب أن نكون قد وضعنا الماء في الفريزر مسبقا فقطع الثلج من المكونات الأساسية للمشروبات الباردة بشكل كبير.
ثم نضع الحليب في الخلاط الكهربائي و نضيف اليه السكر والكاكاو والنسكافيه ونشغل الخلاط لدقيقتين تقريبا و حتى تمتزج المكونات بشكل كلي.
بعدها نضيف قطع الثلج ونشغل الخلاط لحوالي دقيقة تقريبا حتى تتشكل الرغوة ثم نسكب المزيج في كؤوس التقديم ونزين بالشوكولاته وبذلك يكون الموكا البارد جاهزا للتقديم. بالصحة والهناء.
 ''',
  ),

  ModelCake(
    image: 'images/drink8.jpg',
    image1: 'images/d17.jpg',
    image2: 'images/d18.jpg',
    name: ' فرابتشينو',
    desc: 'طريقه عمل فرابتشينو في البيت مثل المحلات',
    text1: '\n 2 كوب من الحليب'
        '\n٢ معلقه كاكاو بودره'
        '\n٢ معلقه كبيره سكر'
        '\n٢ معلقه صغيره من النسكافيه'
        '\n٢ معلقه صغيره نوتيلا'
        '\nايس كريم فانيليا وشكولاته',
    longDesc: '''اولا نقوم بغلي الحليب ،ثم ننتظر قليل الي ان يبرد.
والان نضع الحليب في الخلاط الكهرباء ونضيف عليه معلقتين كاكاو ومعلقتين نسكافيه وايضا معلقتين ونوتيلا واخيرا الايس كريم ثم نخهم في الخلاط .
والان نضع الخليط الذي تم اعداده في اكواب وندخله الثلاجه حتى يتجمد ويكون ذلك تقريبا لمده نص ساعه .
واخيرا بعد التجميد ضعي علي الوجه الكريمه او القشطه او الصوص الذي تفضليه ويقدم''',
  ),
  ModelCake(
    image: 'images/drink9.jpg',
    image1: 'images/d19.jpg',
    image2: 'images/d20.jpg',
    name: ' تروبيكال',
    desc: ' عصير تروبيكال صن شاين، وهو أحد الوصفات العالمية اللذيذة، من المشروبات الباردة السهلة والمناسبةلفصل الصيف.',
    text1: '\n 2كوب مانجو مقطعة ومثلجة'
        '\nكوب اناناس مقطع ومثلج'
        '\nموزة مقطعة'
        '\n1/4كوب عصير برتقال'
        '\nكوب من الماء'
        '\n1/4ملعقة مستخلص جوز الهند'
        '\n1/4 كوب زبادي',
    longDesc: '''ضعي جميع المكونات في الخلاط الكهربائي واخلطي جيداً .
 إذا كان العصير سميك يمكنك إضافة الماء أو عصير البرتقال للتخفيف .
 قدميه في كأس التقديم .''',
  ),
  ModelCake(
    image: 'images/drink10.jpg',
    image1: 'images/d21.jpg',
    image2: 'images/d22.jpg',
    name: 'عصير بلح',
    desc: 'عصير البلح باللبن من العصائر المغذية للغاية',
    text1: '\n 1/4 كيلو (250 جم) بلح مجفف منزوع النوى'
        '\n٢كيلو (1000 مل) حليب'
        '\n٢ملعقة صغيرة (5 مل) فانيليا سائلة'
        '\n٢ معلقه صغيره من النسكافيه',
    longDesc: '''على نار متوسطة، ضعي الحليب حتى يغلي. ارفعي الحليب من على النار، ثم أضيفي البلح، واتركيه جانبًا حتى يبرد تمامًا. ضعي خليط البلح والحليب في الخلاط، ثم أضيفي الفانيليا، واخلطي جيدًا. صبي العصير في أكواب التقديم، وقدميها باردة.''',
  ),
  ModelCake(
    image: 'images/drink11.jpg',
    image1: 'images/d23.jpg',
    image2: 'images/d24.jpg',
    name: 'عصير البطيخ',
    desc: 'يعدّ البطيخ فاكهة الصيف المميزة، تعلمي طريقة عمل أطيب العصائر الطبيعية من البطيخ بأسهل خطوات وألذ طعم',
    text1: '\n 4  أكواب من قطع البطيخ'
        '\nعصير ليمون حامض طازج'
        '\n1/2 كوب من عصير البرتقال أو التفاح.'
        '\n1/4  كوب من السكر'
        '\n1  ملعقة كبيرة من قشر الليمون'
        '\n2  ملعقة صغيرة من أوراق النعنع الطازجة المقطّعة'
        '\nأوراق نعنع للتزيين',
    longDesc: '''يوضع البطيخ على شكل طبقة واحدة ويترك في الثلاجة حتى يتجمد أو حتى يصبح متماسكاً .
تغمر أطراف أكواب الكوكتيل بعصير الليمون ثم تغمس بالسكر .
توضع قطع البطيخ المجمدة والمكونات الأخرى في الخلاط وتمزج حتى تصبح المكونات متجانسة .
يصب العصير في الأكواب، ويزيّن بأوراق النعنع .
''',
  ),

];

List<ModelCake> menu4 = [
  ModelCake(
    image: 'images/adv0.jpg',
    text1: 'لنجاح العجين',
    longDesc: '''لما تيجي تعملي معجنات وتضيفي للدقيق كيس بيكنج بودر مع الخميره العجينه هتبقى احلى وهتعلى اكتر
''',
  ),
  ModelCake(
    image: 'images/adv1.jpg',
    text1: 'لو الكيكه نشفت',
    longDesc: '''لو عملتي كيكه وطلعت ناشفه معاكي اسقيها عصير برتقال بعد ما تطلع من الفرن او حتى لما تبرد هتلاقيها بقت طريه وهتحسي بالفرق''',
  ),
  ModelCake(
    image: 'images/adv2.jpg',
    text1: 'لو المعجنات نشفت',
    longDesc: '''لما تكوني بتعملي أي معجنات في الفرن وحسيتي انها نشفت منك غطيها اول ما تطلع من الفرن وسيبيها ربع ساعه هتبقا طريه''',
  ),
  ModelCake(
    image: 'images/adv3.jpg',
    text1: 'عند التسويه',
    longDesc: '''قبل ما تسوي اي حاجه في الفرن لازم تسخنيه كويس الأول''',
  ),
  ModelCake(
    image: 'images/adv4.jpg',
    text1: 'كاسترد طلع خفيف ',
    longDesc: '''لو عملتي كاسترد وطلع خفيف معاكي ممكن تضيفي له شوية دقيق واخلطيه معاه كويس , ولو لسه خفيف ممكن تحطيه على النار شويه كمان عشان يتقل , او بعد ما تعمليه حطيه في التلاجه قوامه هيتقل''',
  ),
  ModelCake(
    image: 'images/adv5.jpg',
    text1: 'لكيكه هشه',
    longDesc: '''استبدلى الحليب في الكيك بالزبادي أو اي مشروب غازي زي الميرندا أو السفن هايخليها هشة و مرتفعة''',
  ),
  ModelCake(
    image: 'images/adv6.jpg',
    text1: 'بان كيك ناجح',
    longDesc: '''البان كيك : لو دايما بتقابلك مشكله لما تيجي تعملي البان كيك بيلزق منك في الطاسه وبيتقطع , ده ليه اكتر من سبب ممكن تكون العجينه طريه اوي وفي الحاله دي ضيفي لها شوية دقيق , لو الدقيق نوعيته مش حلوه ممكن تضيفي له شوية | دقيق سميد " سيمولينا و ومهم اوي عشان البان كيك يطلع مظبوط معاكي سخني الطاسه كويس مع الزيت وبعدين حطي الخليط في الطاسه ولازم نمسح الطاسه بفوطه نضيفه وندهنها نقطتين زيت او زبده بين كل واحده والتانيه''',
  ),
  ModelCake(
    image: 'images/adv7.jpg',
    text1: 'لدهن الفطائر',
    longDesc: '''بديل البيض لدهن الفطائر دوبي معلقتين كبار حليب بودره في كوب ماء دافي مع رشة نسكافيه وقلبيهم كويس مع بعض وادهني بيهم الفطائر قبل ما تدخل الفرن''',
  ),
  ModelCake(
    image: 'images/adv8.jpg',
    text1: 'لكوكيز افضل',
    longDesc: '''لو هتعملى بسكويت خاصة الكوكيز اعملي العجينه وسبيها متغطيه في التلاجه من يوم لخمس ايام كأنها بتتبل وكل ما تسبيها كل ما طعمها يبقى احلى''',
  ),ModelCake(
    image: 'images/adv9.jpg',
    text1: 'لدهن قوالب الكيك',
    longDesc: '''قوالب الكيك بتدهن زبده او سمنه بلاش ندهن زيت عشان الزيت بيتحرق بسرعه ومش بيتحمل الحراره زي الزبده والسمنه''',
  ),
  ModelCake(
    image: 'images/adv10.jpg',
    text1: 'لنجاح الدوناتس',
    longDesc: '''نصائح لنجاح الدوناتس - لازم نتأكد من نوع وصلاحية الخميره والبيكنج بودر - لازم نعجن كويس حوالي 15-10 دقيقه عشان العجينه تنعم بعد التخمير . - بلاش نبالغ في كمية الدقيق اللي هنفرد بيها على الرخامه ولما نيجي نفرد العجينه لازم نفردها طبقه سميكه مش رفيعه . - ضروري جدة نسيبها تخمر بعد التقطيع . - الزيت اللي هنقلي فيه لازم يكون حرارته متوسطه مش سخن اوي - ارتفاع الدوناتس في الزيت وظهور خط ابيض في النص يدل على نجاح الوصفه .''',
  ),
  ModelCake(
    image: 'images/adv11.jpg',
    text1: 'الرز باللبن',
    longDesc: ''' الرز باللبن ضيفي عليه کيس بودرة كريم شانتيه مع النشا هيخلى الطعم جامد وزي بتاع برا بالظبط''',
  ),
  ModelCake(
    image: 'images/adv12.jpg',
    text1: 'لو هتعملي كوكيز',
    longDesc: '''الكوكيز اعملي منه كميه وكوريها وحطيها في صيني ودخليها الفريزر وبعد كده جمعيها في كيس في الفريزر كل فتره طلعي منه واخبزيه طازه بطازه ممكن يقعد الحد حوالي 12 اسبوع في الفريزر''',
  ),
  ModelCake(
    image: 'images/adv13.jpg',
    text1: 'عصير الجوافه',
    longDesc: '''الو حطيتي نصف ليمونه على عصير الجوافه عمره ما هيسود وطعمها هيبقا أجلى''',
  ),
  ModelCake(
    image: 'images/adv14.jpg',
    text1: 'قشره ذهبيه للكيك',
    longDesc: '''للحصول على قشره ذهبيه لذيذه على سطح الكيك رشي شوية لبن بودره على سطح القالب قبل ماتدخليه الفرن''',
  ),
  ModelCake(
    image: 'images/adv16.jpg',
    text1: ' الكرواسون الناجح',
    longDesc: '''- الكرواسون من المخبوزات الحساسه للكميات والمعايير في المقادير، فلازم نلتزم بالوصفه بالظبط.
- اهم حاجه لازم نستخدم نوع زبده كويس جداً.
- المياه واللبن لازم يتضافوا دافيين مش باردين ولا سخنين.
- لازم نفرد العجين بالنشابه كويس لحد ما الطبقة تبقا رقيقه.
- لازم العجين يخمر مرتين مره واحنا بنعمله و مره بعد التشكيل.
- يخبز الكرواسون بصواني غير قابله للإلتصاق، ومش هندهن الصواني بأي حاجه قبل مانحط الكرواسون عشان العجين بيكون فيه زبده كفايه تمنعه من انه يلزق في الصينيه.
- لازم نسخن الفرن قبل ماندخل فيه الكرواسون ب 10 دقايق ولازم نحط الصينيه على في منتصف الفرن ونتجنب فتح الفرن اثناء التسويه.''',
  ),

];